# 1、计算100到200范围内能被7或者9整除但不能同时被这两者整除的数的个数。
# a = 100
# while a < 200:
#     a = a + 1
#     if a % 7 == 0 or a % 9 == 0:
#         if not (a % 7==0 and a % 9 == 0):
#             print(a)

#2、50到70之间偶数的平均值
# a = 50
# b = 0
# c = 0
# while a <= 70:
#
#     if a % 2 == 0:
#         b =a+b
#         c =c+1
#     a = a + 1
# print(b/c)
#3、一个球从100米高度自由落下，每次落地后弹回原来高度的一半，
# 求它在第10次落地前，离地多高，第10次落地时共经过多少米？
# a = 100
# while  <10:
#     if a /2== c :
#         print(c)
#
# a = 100 # 高度
# b = 1 # 计算下落次数
# c = 100 # 计算经过米数
# while b < 10:
#     a = a / 2
#     if b == 9:
#         print("第 10 次落地前，离地",a,"米")
#     b = b + 1
#     c = c + 2 * a
# print("第", b, "次落地经过", c, "米")
#










